## Exercise 4 - SQLite

1 Add the necessary libraries for SQLite3 and make a database named `test.db`.

In [2]:
import sqlite3
database_connection = sqlite3.connect("test.db")

2 Create a connection to the database.

In [3]:
con = database_connection.cursor()

3 Make the following table in the database, named `people`:
    
| name | age | shoe_size |
| ------------- |-------------| -----|
| Prank | 88 | 47 |
| Matt | 34 | 39 |
| Ilona | 41 | 36 |
| Sonja | 32 | 37 |

In [3]:
con.execute("CREATE TABLE IF NOT EXISTS people (name, age, shoe_size)")
con.execute('''
    INSERT INTO people VALUES
            ("Prank", 88, 47),
            ("Matt", 34, 39),
            ("Ilona", 41, 36),
            ("Sonja", 32, 37)
''')
database_connection.commit()

4 When the Table has been created, convert the table to the Pandas DataFrame object and add the column `hat_size' to it, then fill that column with the values ​​you choose.

In [ ]:
import pandas as pd
sql_query = '''SELECT * FROM people'''
sql_dataframe = pd.read_sql(sql_query, database_connection)
new_column = "ALTER TABLE people ADD COLUMN hat_size"
con.execute(new_column)
con.execute('''UPDATE people SET hat_size = 25 WHERE age = 88;''')
con.execute('''UPDATE people SET hat_size = 22 WHERE age = 34;''')
con.execute('''UPDATE people SET hat_size = 27 WHERE age = 41;''')
con.execute('''UPDATE people SET hat_size = 30 WHERE age = 32;''')
database_connection.commit()

5 Make a copy of the DataFrame object with the name `person_table_copy` and add a row to it with the values ​you choose. Now save this modified dataframe object in the database as `person_table_copy` (will be created next to the previous table).

In [ ]:
personal_table_copy = sql_dataframe.copy()
personal_table_copy.to_sql("person_table_copy", database_connection, if_exists='replace', index=False)
con.execute('''
    INSERT INTO person_table_copy (name, age, shoe_size, hat_size) 
    VALUES ("John", 25, 42, 24)
''')

6 Finally, save the database changes and close the connection.

In [22]:
import pandas as pd
sql_query_copy = '''SELECT * FROM person_table_copy'''
sql_dataframe_copy = pd.read_sql(sql_query_copy, database_connection)
print(sql_dataframe)
print(sql_dataframe_copy)
database_connection.commit
database_connection.close

    name  age  shoe_size  hat_size
0  Prank   88         47        25
1   Matt   34         39        22
2  Ilona   41         36        27
3  Sonja   32         37        30
    name  age  shoe_size  hat_size
0  Prank   88         47        25
1   Matt   34         39        22
2  Ilona   41         36        27
3  Sonja   32         37        30
4   John   25         42        24